In [1]:
import pandas as pd

In [3]:
with open("../../Dados/alunos.csv") as alunos:
    aln = pd.read_csv(alunos, sep=',')

In [14]:
aln.to_xml('arquivo.xml', index=False)

In [15]:
aln.head()

            name escolaridade         notas regiao  idade
0       John Doe  High School  [85, 90, 78]  North     17
1     Jane Smith      College  [92, 88, 95]  South     20
2   Alex Johnson  High School  [76, 82, 70]   East     16
3    Emily Davis      College  [89, 91, 87]   West     22
4  Michael Brown  High School  [80, 75, 82]  North     18

In [32]:
aln.filter(like='1', axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]